app/controllers/events_controller.rb

  def index
    if params[:page_id]
      @events = Event.find_all_by_event_date(true)
      @events_pages, @events = paginate(:events,
                                        :order => 'event_date ASC',
                                        :conditions => "page_id=#{params[:page_id].to_i} AND event_date >= DATE(NOW())")
      @page = Page.find(params[:page_id].to_i)
    else
      @events = Event.find_all_by_event_date(true)
---
SELECT * FROM `events` WHERE (`events`.`event_date` = 1)
SELECT * FROM `events` WHERE (event_date >= DATE(NOW())) ORDER BY event_date ASC LIMIT 50

  def create
#    @event = Event.create(params[:event])
#    redirect_to admin_events_url
		@event = Event.new(params[:event])
		@event.save!
---
INSERT INTO `events` (`created_at`, `title`, `body`, `updated_at`, `page_id`, `event_date`) VALUES('2011-09-27 14:10:34', 'sdfghsd ', '<p>\r\n	sfdgh sdfhg sdfh s</p>\r\n', '2011-09-27 14:10:34', 1, '2011-09-12 00:00:00')

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 2)

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)
DELETE FROM `events` WHERE `id` = 1