app/controllers/foods_controller.rb

  def show
    @food = Food.find_by_permalink(params[:id])
---
SELECT * FROM `foods` WHERE (`foods`.`permalink` = 'pizzeria') LIMIT 1

  def create
    @food = Food.new(params[:food])
    @food.save!
---
INSERT INTO `foods` (`permalink`, `created_at`, `title`, `body`, `updated_at`, `opening`) VALUES('pizzeria', '2011-09-29 14:17:37', 'Pizzeria', '<p>\r\n	dftu edfyu dhjd ghjdg&nbsp;</p>\r\n', '2011-09-29 14:17:37', '10am-midnight')

  def edit
    @food = Food.find_by_permalink(params[:id])
---
SELECT * FROM `foods` WHERE (`foods`.`permalink` = 'pizzeria') LIMIT 1

  def update
    @food = Food.find_by_permalink(params[:id])
    @food.attributes = params[:food]
    @food.save!
---
SELECT * FROM `foods` WHERE (`foods`.`permalink` = 'pizzeria') LIMIT 1
UPDATE `foods` SET `updated_at` = '2011-09-29 14:20:42', `opening` = '10am-midnight sdfgsdf gdfgsdgs', `title` = 'Pizzeria sdfg sdfg', `body` = '<p>\r\n	dftu edfyu dhjd ghjdg d gsdfgs dfgs dgf</p>\r\n' WHERE `id` = 1

  def destroy
    @food = Food.find_by_permalink(params[:id])
    if @food.destroy
---
SELECT * FROM `foods` WHERE (`foods`.`permalink` = 'pizzeria') LIMIT 1
DELETE FROM `foods` WHERE `id` = 1