app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` BETWEEN 2 AND 4)
SELECT * FROM `events` WHERE (page_id = 1 AND event_date >= DATE(NOW())) ORDER BY event_date ASC LIMIT 3
SELECT * FROM `sports` WHERE (page_id = 1 AND event_date >= DATE(NOW())) ORDER BY event_date ASC LIMIT 3
---
  def index
    #@pages = Page.find(:all)
    @page = Page.find(1)
    @pageevents = Event.find(:all,
                             :limit => 3,
                             :conditions => "page_id = #{@page.id} AND event_date >= DATE(NOW())",
                             :order => 'event_date ASC')
    @pagesports = Sport.find(:all,
                             :limit => 3,
                             :conditions => "page_id = #{@page.id} AND event_date >= DATE(NOW())",
                             :order => 'event_date ASC')

SELECT * FROM `pages` WHERE (`pages`.`permalink` = 'home') LIMIT 1
SELECT * FROM `events` WHERE (page_id = 2 AND event_date >= DATE(NOW())) ORDER BY event_date ASC LIMIT 3
SELECT * FROM `sports` WHERE (page_id = 2 AND event_date >= DATE(NOW())) ORDER BY event_date ASC LIMIT 3
---
  def show
#    @page = Page.find(params[:id].to_i)
    @page = Page.find(:first, :conditions => {:permalink => params[:id].to_s})
    @foods = Food.find(:all)

    @pageevents = Event.find(:all,
                             :limit => 3,
                             :conditions => "page_id = #{@page.id} AND event_date >= DATE(NOW())",
                             :order => 'event_date ASC')
    @pagesports = Sport.find(:all,
                             :limit => 3,
                             :conditions => "page_id = #{@page.id} AND event_date >= DATE(NOW())",
                             :order => 'event_date ASC')

INSERT INTO `pages` (`permalink`, `created_at`, `size`, `title`, `body`, `content_type`, `updated_at`, `thumbnail`, `filename`, `path`, `height`, `synopsis`, `width`) VALUES('the_back_shed_pizzeria', '2011-09-27 12:39:02', NULL, 'The Back Shed Pizzeria', 'With friendly staff, efficient service and good quality food the Back Shed Pizzeria can cater for all your dining needs. We are family-friendly with a dedicated kids menu, crayons and colouring books to keep the young occupied while parents can relax and eat.\r\n\r\nBookings are for 8 or more but smaller parties are welcome to pop in and if a table is not immediately available you will be given an estimated waiting time and can relax in our bar downstairs with a pre-dinner drink until your table becomes free.', NULL, '2011-09-27 12:39:02', NULL, NULL, NULL, NULL, '', NULL)
---
  def create
    @page = Page.new(params[:page])
    @page.save!

SELECT * FROM `pages` WHERE (`pages`.`permalink` = 'contact') LIMIT 1
---
  def edit
#    @page = Page.find(params[:id].to_i)
    @page = Page.find(:first, :conditions => {:permalink => params[:id].to_s})

SELECT * FROM `pages` WHERE (`pages`.`permalink` = 'contact') LIMIT 1
UPDATE `pages` SET `updated_at` = '2011-09-27 12:35:23', `title` = 'The Back Shed Bar', `body` = '<p>Welcome to the Back Shed Bar and Pizzeria opened in December 2000.</p>\r\n<p>Entertaining regulars both young and old since opening, it has made its name as the most welcoming and friendly bar in Antrim.</p>\r\n<p>The Back Shed is the ideal choice whether it\'s an after work drink, dinner or a great night out we have something to offer everyone. With live entertainment every Friday and Saturday night and large Screen TVs perfect for all your sporting needs!</p>\r\n' WHERE `id` = 1
---
  def update
#    @page = Page.find(params[:id].to_i)
    @page = Page.find(:first, :conditions => {:permalink => params[:id].to_s})
    @page.attributes = params[:page]
    @page.save!

SELECT * FROM `pages` WHERE (`pages`.`id` BETWEEN 2 AND 4)
SELECT * FROM `events` WHERE (page_id = 1 AND event_date >= DATE(NOW())) ORDER BY event_date ASC LIMIT 3
SELECT * FROM `sports` WHERE (page_id = 1 AND event_date >= DATE(NOW())) ORDER BY event_date ASC LIMIT 3
---
  def admin
    @pages = Page.find(:all)
    @page = Page.find(1)

    @pageevents = Event.find(:all,
                             :limit => 3,
                             :conditions => "page_id = #{@page.id} AND event_date >= DATE(NOW())",
                             :order => 'event_date ASC')
    @pagesports = Sport.find(:all,
                             :limit => 3,
                             :conditions => "page_id = #{@page.id} AND event_date >= DATE(NOW())",
                             :order => 'event_date ASC')