app/controllers/photos_controller.rb

  def admin
    @photos = Photo.find(:all,
                         :conditions => "thumbnail is NULL",
                         :order => 'created_at DESC')
---
SELECT * FROM `photos` WHERE (thumbnail is NULL) ORDER BY created_at DESC

  def index
    #photos_count = Photo.count(:conditions => "thumbnail = 'thumb'")
    photos_count = Photo.count(:conditions => "thumbnail is NULL")
    @photo_pages = Paginator.new(self, photos_count, 10, params[:page])
 #   @photos = Photo.find(:all,
 #                        :conditions => "thumbnail = 'thumb'",
 #                        :order => 'created_at DESC',
 #                        :limit => @photo_pages.items_per_page,
 #                        :offset => @photo_pages.current.offset)
    @photos = Photo.find(:all,
                         :conditions => "thumbnail is NULL",
                         :order => 'created_at DESC',
                         :limit => @photo_pages.items_per_page,
                         :offset => @photo_pages.current.offset)
---
SELECT * FROM `photos` ORDER BY RAND() LIMIT 1
SELECT count(*) AS count_all FROM `photos` WHERE (thumbnail is NULL)
SELECT * FROM `pages` WHERE (`pages`.`id` BETWEEN 2 AND 4)
SELECT * FROM `photos` WHERE (thumbnail is NULL) ORDER BY created_at DESC LIMIT 0, 10

  def show
    @photo = Photo.find(params[:id].to_i)
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 0)

  def create
    @photo = Photo.new(params[:photo])
    @photo.save!
---
INSERT INTO `photos` (`created_at`, `size`, `title`, `body`, `content_type`, `thumbnail`, `filename`, `path`, `parent_id`, `height`, `width`) VALUES('2011-09-29 13:58:01', 56762, 'A kitten', NULL, 'image/jpeg', NULL, 'C360_2011-03-15_17-22-44.jpg', NULL, NULL, NULL, NULL)

  def edit
    @photo = Photo.find(params[:id].to_i)
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)

  def update
    @photo = Photo.find(params[:id].to_i)
    @photo.attributes = params[:photo]
    @photo.save!
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
UPDATE `photos` SET `photo_file_name` = 'IMG_20110315_172043.jpg', `photo_updated_at` = '2011-10-04 14:09:57', `photo_file_size` = 492990, `photo_content_type` = 'image/jpeg' WHERE `id` = 1

  def destroy
    @photo = Photo.find(params[:id].to_i)
    if @photo.destroy
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
DELETE FROM `photos` WHERE `id` = 1