app/controllers/sports_controller.rb

SELECT * FROM `sports` WHERE (event_date >= DATE(NOW())) ORDER BY event_date ASC LIMIT 0, 10
---
  def index
    if params[:page_id]
      @sports_pages, @sports = paginate(:sports,
                                        :order => 'event_date DESC',
                                        :conditions => "page_id=#{params[:page_id].to_i} AND event_date >= DATE(NOW())")
    else
      @sports = Sport.find_all_by_event_date(true)

SELECT * FROM `sports` WHERE (`sports`.`id` = 1)
---
  def show
    @sport = Sport.find(params[:id])

INSERT INTO `sports` (`created_at`, `title`, `body`, `updated_at`, `page_id`, `event_date`) VALUES('2011-09-30 13:17:17', 'sfghdfghdf', '<p>\r\n	ghdfghdfghd</p>\r\n', '2011-09-30 13:17:17', 2, '2011-09-30 00:00:00')
---
  def create
#    @sport = Sport.create(params[:sport])
#    redirect_to admin_sports_url
		@sport = Sport.new(params[:sport])
		@sport.save!